[
	{
		"id": 1,
		"title": "TOY STORY 4",
		"date" : "05/07/2019",
		"body": "<p>I Can't Let You Throw Yourself Away, sings Randy Newman, Pixar's bard, in a montage from Toy Story 4. The song's title is aimed at Woody (Tom Hanks), a friend to his original owner, Andy, and later to Bonnie, a five-year old who inherited Andy's toys at the end of Toy Story 3 and is shown refining her own playtime rituals that don't always include Woody. Secondarily, the song is officially aimed at a new character, Forky (Tony Hale), a plastic spork with popsicle-stick feet and pipe cleaner arms, created by Bonnie with material  supplied by Woody during orientation day at kindergarten. Typical of Toy Story, a series where inanimate objects don't merely have personalities but existential crises, Forky keeps breaking away from Bonnie and Woody and trying to hurl himself into the nearest trash receptacle. This is not a comment on his own feelings of worthiness. but an expression of the fact that Forky is, after all, a utensil, and feels most comfortable in the trash, secure in the knowledge that he fulfilled his purpose. </p><p>But I Can't Let You Throw Yourself Away also expresses the audience's feelings for this beloved series, which has continued over nearly a quarter century, producing four installments that run the gamut from excellent to perfect. We don't want the story of Toy Story to end, but we also don't want it to become a plaything taken down from the shelf out of obligation rather than excitement. If the makers of Toy Story 4 shared these anxieties, they've merged them into plot of this movie. Among other things, it's about a devoted playmate's fear that he's become obsolete, boring, not special anymore, and otherwise incapable of holding the attention of a child. </p><p>But, as old toy commercials used to promise: that's not all! Although the first part of the movie concentrates on the relationship between Woody and Forky (who have a long, uncut walk-and-talk that strangely evokes both Of Mice and Men and Midnight Cowboy), the rest of Toy Story 4 distributes its attention democratically among playthings that we know from before, including Tim Allen's Buzz Lightyear and Joan Cusack's Cowgirl Jesse, and new toys that we meet during the family's week-long Winnebago road trip. The latter include Keegan Michael-Key and Jordan Peele as Ducky and Bunny, wisecracking plush collectibles that Buzz meets at a fairground ball-toss; Keanu Reeves as Duke Caboom, a Evel Knievel-styled motorcycle rider who describes himself as the greatest stuntman in Canada; and Christina Hendricks as Gabby Gabby, a 1950s-era talking doll whose voice box is broken, and spends her days ruling a desolate kingdom of unclaimed toys in an antique shop. (It wouldn't be a Toy Story film without a touch of the sinister, and Gabby provides it with help from her minions, a set of identical ventriloquist's dummies whose big heads tilt when they run.) </p><p>As the story unfolds, we're treated to all of the elements that we've come to expect, including a mission to rescue a missing or kidnapped toy, a climactic action sequence reuniting separated characters, and a moment where a toy hilariously breaks the rule against letting humans know they're alive. But on the whole, Toy Story 4—which was written by Stephanie Folsom and Pixar veteran Andrew Stanton (Finding Nemo) and directed by Josh Cooley (Inside Out)—breaks somewhat with tradition, in that it's less of a straightforward, linear comedy-adventure than a patchwork of scenes, moments, and groups of characters, unified more by shared themes and ideas than by any particular thing that happens. It's a stretch to call this a Robert Altman movie with little plastic toys, but darned if it doesn't get close to that sometimes.</p><p>Also in Toy Story tradition—perhaps more so than ever—this entry is flexible in its metaphors, in the way that dreams are flexible: i.e., a character or storyline can mean more than one thing at the same time. This allows the viewers to imprint their fears and dreams onto the material, and subtly change how they read a moment without contradicting themselves (or worrying that movie is contradicting itself). </p><p>Kids won't understand much of this, but they won't need to, because the film's surface level is designed to be legible to any child old enough to understand a tale told in images. (Listen during the opening Pixar logo for the sound of a small child laughing when the desk lamp turns to look at the audience; it's been happening since 1986.) Ultimately, anything these toys desire is driven mainly by the fact that they're toys, and the series has always been clear about what motivates them. They inhabit a world with rules and a code as clearly laid out as the ones in the John Wick and body snatchers and Batman franchises. The toys are all defined by their relationship to a child, whether it's a relationship that still is, once was, or hasn't happened (yet).</p><p>Once you get beyond that, things get curiouser and curiouser. The toys in the Toy Story films simultaneously stand in for children and adults (more the latter than the former—as When She Loved Me from Toy Story 2, one of the saddest songs in film history, testifies). But Woody's specific mix of anxiety and depression here seems more like that of a grandparent than a parent. Woody's polite but frantic takeovers of Bonnie's playtime evoke a newly-employed senior citizen starting at a new workplace that's staffed mainly by younger folk who have their own way of doing things; and also a grandparent whose own kids grew up and left the house, and is now manufacturing a fresh sense of purpose by turning into a busybody who micromanages his granddaughter's life, and second-guesses her parents. Really, Woody didn't have to go to to kindergarten with Bonnie, and it's possible that his artistic midwifing of Forky caused new complications for him and his pals. It’s like an older parent having (or adopting) a new baby, years after the first round has left the nest.</p><p>Even more so than in the first Toy Story, where Woody feared his old-school charm would be overshadowed by a flashy new spaceman, or the second and third movies, which centered on toys' fears that children will mature and abandon them, the cowboy is fretting over the likelihood of forced retirement, followed by erasure. Fear of death, whether in body, spirit, or reputation, lingers over the movie, though never so heavily that you forget to laugh at the toys being silly.</p><p>This cowboy has a snake in his boot, and subtext in his text. Every time Woody prevents Forky from breaking away and leaping into a garbage can, or sneaking off Bonnie's pillow at night and sliding into the trash bucket near her bed, he's symbolically postponing his own extinction, which he avoided in physical fact at the end of Toy Story 3 (that terrifying sequence in the furnace) but could still experience by being locked away in a glass case (by somebody like The Collector from Toy Story 2) or placed on a dusty shelf in a small-town antique shop (which happens to many old toys here) or simply tossed in the back of Bonnie's closet and forgotten. An elder quartet of Bonnie toys—voiced by Carol Burnett, Mel Brooks, Carl Reiner, and Betty White—assure Woody that these things happen to all toys eventually.</p><p>The relationship of toys to kids, and kids to parents/grandparents, is widened out even more by a screenplay that considers the relationship of parents and children to society, and how that same society assigns worth to adults based on whether they've paired themselves off with a child. The secret, unheralded costar of Toy Story 4, and the focus of its most emotionally complex scenes, is Bo Peep (Annie Potts), Woody's sweetheart, who went AWOL in Toy Story 3 but gets her missing chapter filled in here. When Woody meets Bo Peep again, she's essentially a hard-edged but self-sufficient single lady, driving around in a motorized skunk toy, and treating her three-headed sheep as kids (kids are what you call baby goats, which is why they're named Billy, Goat, and Gruff—this series has linguistic as well as visual layers). </p><p>Bo Peep is an instinctive shepherd to lost lambs of all sorts, but she uses her crooked staff as a climbing tool and defensive weapon as well as a means of corralling unruly children. And it seems a stretch to call her a born mom, because who's to say she wasn't actually born to be the person she is at this moment? Who needs a kid's room when you can have all of this? she asks Woody, sweeping her crook across the panorama of the fairgrounds. (We also learn her secret nickname for Woody, which is less heroic than he might like: the rag doll.)</p><p>Without putting too fine a point on it, Toy Story 4 lets Woody and Bo Peep have a running dialogue about whether you're more or less of a toy, or a happier or sadder example of a toy, if you have a child's name scrawled on the bottom of your foot. Their relationship encloses preoccupations of other characters, all of whom are grappling with nature vs. nurture, and whether a sense of purpose is something you find on your own or accept after society hands it to you—whether it's Bo Peep rejecting traditional motherhood (she's content to be a mom to her sheep) or Forky rejecting Woody's assertion that he's a toy rather than a utensil, or Ducky and Bunny and Gabby pining for children of their own because they've been conditioned to feel incomplete without them. </p><p>Gabby's longing is associated with her lack of a voice, which is about as on-the-nose as the film gets. She covets the intact voice box of Woody, who's had happy bonds with two children, and believes that if she can claim his voice for herself, she'll acquire his child-pairing mojo as well. When my voice box is fixed, I'll finally get my chance, she tells herself.  But it's to the film's credit that it never presents either Bo Peep or Gabby's world view as the only legitimate one. Both are allowed to experience their own, tailored kinds of contentment. And how sweet it is that, for the first time since the original Toy Story, there are no outright villains here, even coded ones—just strong-willed antagonists whose psychology sometimes pushes them to do bad things.</p><p>Several characters are also in dialogue with some sort of inner voice, whether it's Woody speaking to himself in his own dialogue box, Buzz randomly punching every speaking button on his torso hoping to experience a self-communion as rich as Woody's, or Bo Peep communing with a tiny best girlfriend toy named Giggle McDimples (Ally Maki), who sits on her shoulder a la Tinkerbell or Timothy the Mouse, dispensing relationship guidance and negotiating advice. So what we have here is a movie that speaks simultaneously to us, to itself, to all of its predecessors, and to the culture that shaped it, and that it has helped shape.  </p><p>Few blockbuster movie series are so likable and accessible to people of all ages and cultures, yet at the same time so rich in metaphor, philosophy, and dream language. And aside from Ripley in the first four Alien movies, it's hard to think of a protagonist of a sequential quartet of movies as loaded with myth and metaphor as Woody, a character who never changes size, color, shape, or voice, yet always manages to stand in for many things at once. This franchise has demonstrated an impressive ability to beat the odds and reinvent itself, over a span of time long enough for two generations to grow up in. It's a toy store of ideas, with new wonders in every aisle.</p>",
		"img" : "https://static.rogerebert.com/uploads/review/primary_image/reviews/toy-story-4-2019/hero_story-4-image.jpg"
	},
	{
		"id": 2,
		"title": "JOHN WICK: CHAPTER 3 – PARABELLUM",
		"date" : "05/07/2019",
		"body": "<p>There are any number of thrilling passages in “John Wick: Chapter 3 - Parabellum,” but a moment of true inspiration—when you know that you're in the hands of filmmakers who are intent on creating a work of wit, style, and vision—comes relatively early. Our hero, soulful assassin John Wick (Keanu Reeves), is at the New York Public Library to find a very specific book when he's interrupted by one of the approximately 11 million people who will attempt to kill him over the course of the next two hours of screen time. Eventually John kills him by utilizing the book he's holding as a weapon. That part is great, but the moment of true inspiration comes next when he goes back and replaces the book on the shelf where he found it. This detail works not because it is funny, but because it fits the character so perfectly that it would almost be weird if he didn’t do it. In a genre where impersonality is the name of the game more than ever, it's a delight.</p><p>In the original “John Wick,” we were introduced to Wick, the recently widowed former member of a shadow cabal of assassins governed by the rules-obsessed High Table, who was spurred back into action when connected punks killed the dog left to him by his late wife. In John Wick: Chapter 2, he was still enmeshed in the world that he had successfully left behind and at the end, he killed a member of the High Table while on the grounds of the Continental Hotel, an establishment designated as a safe ground for those in the assassin trade. This move leads to his being designated “excommunicado” by the High Table—all of his rights and privileges are stripped away and an open contract is issued for one and all on him with a payoff beginning at $14 million—though colleague Winston (Ian McShane) gives him a one-hour head start, partly out of friendship and partly, it appears, for his own amusement.</p><p>Granted, this is not quite as generous as it sounds since it appears that everyone in the Wickiverse, at least those with speaking or bleeding roles, is an assassin themselves. Wick’s plan is to make his way to Morocco in the hopes of tracking down the secretive leader of the High Table in order to make a personal offer to atone for his grave transgression. Although no one in the organization is supposed to offer any assistance to Wick, he does receive some aid from a couple of people from his past—his onetime mentor (Anjelica Huston) and Sofia (Halle Berry), a onetime killer who now runs the Morocco branch of the Continental and owes Wick for a past favor. While he is off trying to find the head of the High Table and fighting off all comers, another member of the organization, known only as The Adjudicator (Asia Kate Dillon) arrives in New York to set things in order and punish both Winston and The Bowery King (Laurence Fishburne) for daring to aid Wick. To help carry this out, they enlist the services of Zero (Mark Dacascos), a sushi chef with an endless array of deadly ninjas at his service, all of whom seem giddy at the possibility of fighting the legendary John Wick.</p><p>When the original “John Wick” came out, audiences expecting just another dopey action film were shocked to find that it was a borderline brilliant work that contained an unexpectedly smart and funny screenplay, a performance from Keanu Reeves that bordered on the sublime in the way that it properly utilized his unique persona, and action sequences so stylishly executed that they reminded viewers of the best works of such genre masters as Walter Hill, John Woo, and Luc Besson. Amazingly, the follow-up managed to more than clear the high bar set by its predecessor by doubling down on the action beats and by expanding the film’s universe in fascinating ways. If the original “John Wick” was “Mad Max”—a work that transcended expectations to become an instant classic—John Wick: Chapter 2 was “The Road Warrior,” a work that took off from an impossible-to-top source and proceeded to top it.</p><p>As it turns out, “John Wick 3” is not quite the “Fury Road” of the series but is easily its “Beyond Thunderdome,” a work of pop cinema so blissfully, albeit brutally, entertaining that you come out of it feeling even more resentful of its multiplex neighbors for not making a similar effort. The problem is not with the staging of the action scenes—director Chad Stahelski (the former stuntman who also directed the previous installments), along with cinematographer Dan Laustsen, and production designer Kevin Kavanaugh, present us with an endless array of stunning visuals and stuntmen, wreaking gloriously gory havoc with everything from guns and knives to the aforementioned book and even a horse. Where the film does stumble a bit, however, is that the attempts at further world-building are not quite as inspired as in the previous films. The Adjudicator, for example, seems like an interesting idea for a character but nothing much comes of their presence—Dillon is fine but pales in comparison to previous memorable franchise characters played by the likes of Adrianne Palicki and Ruby Rose. </p><p>Still, there are a number of wonderful elements on display in Parabellum. There's Reeves, whose ability to make the most out of the least amount of dialogue would leave the likes of Bronson and Eastwood agog. There are moments of unexpected humor that blindside you—the location where Wick meets his mentor yields a bigger laugh than most actual comedies. And the consistently exciting fight scenes also yield a lot of big laughs, especially during the kills where Wick is forced to use something other than a gun. Oh yes, I almost forgot the dogs. Halle Berry's character is accompanied by a couple of dogs who go on to steal practically every frame of film featuring them, more than holding their own during one of the movie's big fight scenes. No, I haven’t seen “A Dog’s Journey” yet, but if you see only one movie sequel featuring dogs this weekend, I guarantee that “Parabellum” is the one to beat.</p>",
		"img" : "https://static.rogerebert.com/uploads/review/primary_image/reviews/john-wick-chapter-3--parabellum-2019/hero_parabellum-image.jpg"
	},
	{
		"id": 3,
		"title": "SPIDER-MAN: FAR FROM HOME",
		"date" : "05/07/2019",
		"body": "<p>Much like “National Lampoon’s European Vacation” was a perfectly enjoyable if inferior follow-up to the genre-defining, zany ‘80s comedy “Vacation,” “Spider-Man: Far From Home” changes the scenery but can’t quite match the inspired heights of its predecessor.</p><p>Granted, “Spider-Man: Homecoming” is a tough act to follow. Director Jon Watts’ 2017 film was a giddy blast of New York City summertime air, a refreshing reboot with a hugely appealing star turn from Tom Holland in the title role. “Far From Home” also arrives about six months after the game-changing, Oscar-winning animated film “Spider-Man: Into the Spider-Verse,” perhaps the most inventive movie we’ve seen yet inspired by a Marvel comic—or any comic, for that matter.</p><p>Watts is back as director, but this time he’s in the tricky position of helming a film that not only occupies a momentous spot within the ever-developing Marvel Cinematic Universe but also furthers Peter Parker’s individual story. And for a while, “Far From Home” is a lot of fun, especially since it picks up right where “Avengers: Endgame” left off. Working from a script by returning writers Chris McKenna and Erik Sommers, Watts and his team playfully explore what’s happening five years after Thanos’ fateful finger snap and how the world is reshaping in ways that are both major and mundane.</p><p>In that regard, “Far From Home” works best as a high school comedy—which also happened to be the strength of Spider-Man: Homecoming—with teens figuring out in adorably awkward fashion who they are and how to express what they feel within this brave new world. Peter has had a taste of the big time, with all the rush and responsibility that entails, but he just wants to be a normal teenager. He’d rather join his classmates on a summer European adventure—especially the darkly alluring MJ, played once again with humorous, deadpan charm by Zendaya—than save the world from total destruction. Again. And who could blame him? It’s a lot—for him, and for us.</p><p>But duty calls. Because it’s an MCU blockbuster arriving in theaters on July 4 weekend, “Far From Home” also must function as a massive action extravaganza, and here’s where the film is at its weakest. The giant set pieces, and what the villain hopes to achieve through them, are like an empty yet distracting swirl of chaos and noise. Admittedly, that’s the point, and we’ll get to more of that (sans spoilers, naturally) in a bit. But it all feels like overload, like so many swarming, soaring computer-generated blips. “Far From Home” loses its way just as it’s reaching its supposedly thrilling crescendo, its greatest sin being that the scenes with the highest stakes are ultimately kind of dull.</p><p>Jake Gyllenhaal’s Mysterio is at the center of these showdowns, with a mixture of abilities that combine Iron Man’s flying and laser-zapping with Thor’s sartorial tendencies. But who he really is and what he really wants aren’t much of a surprise, although he initially presents himself as an ally and even a hopeful force for the future. Gyllenhaal seems to be having a blast playing dress-up in this setting, and he brings great brio to the scene in which he lays out his (surprisingly understandable) reasoning for his elaborate plan. The actual execution of it all, however, ends up being rather numbing. The real bombshells come during the closing credit sequences—so, as always, be sure to stay in your seat until the very end.</p><p>The laughs bubble up so consistently in the first half that it’s enough to make you wish “Far From Home” was a straight-up romantic comedy. Peter’s goofy notions of how stops in Venice and Paris should go down with MJ are the stuff of moony teenage-boy fantasies. A sweet, parallel romance finds Peter’s wisecracking, scene-stealing best friend, Ned (Jacob Batalon), connecting unexpectedly with the prim, Type-A Betty (Angourie Rice). And a third flirtation—between Tony Stark’s right-hand man, Happy (Jon Favreau), and Peter’s Aunt May (Marisa Tomei)—has some potential but doesn’t go far just yet, although it’s enough to make Peter’s Spidey sense tingle.</p><p>Holland isn’t afforded the depth of character we’ve seen from him previously—most notably during his heartbreaking exit in “Avengers: Infinity War.” But once again, he’s completely charming in the role, bringing a boyish enthusiasm that’s irresistible and wholly different from the ways Tobey Maguire and Andrew Garfield played him in previous incarnations. His Peter even gets to show glimmers of being a flaky kid as he dodges calls from an increasingly, amusingly frustrated Nick Fury (Samuel L. Jackson).</p><p>Perhaps his true superpower is the fact that he seems more like a relatable, fully fleshed-out human being than any other character in the Marvel Cinematic Universe. Surely, we’ll have a multitude of chances to find out for sure.</p>",
		"img" : "https://static.rogerebert.com/uploads/review/primary_image/reviews/spider-man-far-from-home-2019/hero_spider-man-image.jpg"
	},
	{
		"id": 4,
		"title": "AVENGERS: ENDGAME",
		"date" : "05/07/2019",
		"body": "<p>Avengers: Endgame is the culmination of a decade of blockbuster filmmaking, the result of years of work from thousands of people. It is designed to be the most blockbuster of all the blockbusters, a movie with a dozen subplots colliding, and familiar faces from over 20 other movies. It’s really like nothing that Hollywood has produced before, existing not just to acknowledge or exploit the fans of this series, but to reward their love, patience, and undying adoration. The blunt thing you probably want to know most: It’s hard to see serious MCU fans walking away from this disappointed. It checks all the boxes, even ticking off a few ones that fans won’t expect to be on the list. It’s a satisfying end to a chapter of blockbuster history that will be hard to top for pure spectacle. In terms of sheer entertainment value, it’s on the higher end of the MCU, a film that elevates its most iconic heroes to the legendary status they deserve and provides a few legitimate thrills along the way.</p><p>Don’t worry: I will stay very spoiler-free. The main joy of this film is in how its incredibly complex narrative unfolds, and you can go elsewhere if you want that ruined. The disappointing Avengers: Infinity War ended with Thanos finally getting all of the six Infinity Stones he so desperately sought, and then using them to wipe out half of existence, including beloved heroes like Black Panther, Star-Lord, and Spider-Man. Avengers: Endgame picks up a few weeks after The Snap, as the remaining heroes try to pick up the pieces and figure out if there’s a way to reverse Thanos’ destruction.</p><p>Immediately, Endgame is a more focused piece than Infinity War by virtue of having a tighter, smaller cast. (Thanks, Thanos.) It’s a more patient, focused film, even as its plot draws in elements of a dozen other movies. Whereas Infinity often felt bloated, Endgame allows some of the more iconic characters in the history of the MCU a chance to be, well, heroic. No longer mere pawns in a Thanos-driven plot, Iron Man, Captain America, Black Widow, Hulk, and Thor break free of the crowd, ably assisted by Hawkeye and Ant-Man. In a sense, this is the new Avengers, and the tighter group of superheroes reminded me of the charm of Joss Whedon’s first Avengers movie, one in which strong personalities were allowed to bounce off each other instead of just feeling like they were strapped into a rollercoaster headed in the same direction. It also allows space for some of the best acting work in the franchise, particularly from Chris Evans and Robert Downey Jr., who one realizes while watching this have turned Captain America and Iron Man into something larger than life for a generation. The most satisfying aspect of Endgame is in how much it provides the MCU’s two most popular heroes the story arc they deserve instead of just drowning them in a sea of cameos by lesser characters from other movies. In the way it canonizes them, it becomes an ode to the entire Marvel Cinematic Universe.</p><p>What works best about Christopher Markus and Stephen McFeely’s script for Endgame is that one feels, for arguably the first time, a sense of looking back instead of merely trying to set the table for something to come. This film incorporates elements of what fans know and love about the MCU, recalling character beats, origins, and the plots of movies like Iron Man, Guardians of the Galaxy, and Captain America: The First Avenger. Call it cheap fan service, but one of my biggest issues with these films, especially Infinity War, has been a sense that they’re merely commercials for movies yet to be made. Endgame doesn’t have that. Sure, the MCU will go on, but this movie has a finality and depth given to it by MCU history that the others have lacked.</p><p>Of course, it needs to work as just a movie too. The middle hour is as purely enjoyable as the MCU has ever been, but there are times when I wished I could sense a human touch below the incredibly-polished, carefully-planned surface of Avengers: Endgame. In the long build-up first hour, I longed for one of the pregnant pauses about the seriousness of the situation to lead to something that felt spontaneous or an acting decision that didn’t feel like it had been run through a committee. Every single aspect of Endgame has been foreshadowed for years by other films and finely tuned by the hundreds of people it takes to make a movie like this one. The result is a film that often feels more like a product than a piece of art. Roger Ebert once famously wrote that video games can never be art, but he may have been surprised to see art becoming more like a video game, something remarkably programmed and determined, lacking anything that really challenges the viewer.</p><p>However, people aren't lining up at dawn for Avengers: Endgame to challenge them. It’s really about rewarding commitment, fandom, and expectations. Whatever its flaws, Endgame does all of that, and with a sincere admiration for the fans who have made this universe a true cultural phenomenon. The stakes are high and the conclusions actually feel resonant. It’s an epic cultural event, the kind of thing that transcends traditional film criticism to become a shared experience with fans around the world. The biggest question I had coming out was how they could possibly top it ten years from now. </p>",
		"img" : "https://static.rogerebert.com/uploads/review/primary_image/reviews/avengers-endgame-2019/hero_endgame-image.jpg"
	}	
]